<a href="https://colab.research.google.com/github/VictorV1ana/desafios/blob/main/Desafio_Eleva_victor_viana.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Eleva

### Entendendo o problema 
**Objetivo**

Todas combinações de 3 algarismos em que:
 * a soma de um par de números gera um reultado que, de acordo com o dicionário, gera a palavra "sol". 

**Passo a passo**

Eu decidi ir pelo inverso
1. Primeiro vou descobri quais numeros de 3 dígitos posso formar com a lista de números fornecida
2. Descobrir quais somas resultam em 985 porque esse é o resultado de "sol"
3. Transformar os números em palavras baseado no dicionário

**Bibliotecas usadas**
* Pandas 
* Numpy 
* itertools

In [69]:
# importando pandas em numpy para manipulação de dados
import pandas as pd
import numpy as np

## 1) Descobrir os números que podemos formar

In [70]:
# importanto pacote necessário
from itertools import permutations # permutations no caso é o "arranjo"

all_combinations = set()

meusnumeros = "4658923"  # <- os numeros forneccidos

# loop para rodar a iteração
for i in range(1,len(meusnumeros)+1):
    for j in permutations(meusnumeros, 3):
        all_combinations.add("".join(j))

print(all_combinations)

{'943', '496', '648', '584', '235', '852', '643', '395', '864', '953', '529', '482', '863', '345', '652', '349', '845', '526', '842', '982', '683', '284', '329', '692', '294', '594', '829', '423', '452', '549', '493', '324', '859', '453', '356', '358', '539', '259', '352', '954', '389', '364', '695', '862', '983', '623', '658', '659', '934', '268', '653', '382', '465', '624', '328', '485', '532', '698', '849', '685', '843', '924', '935', '629', '398', '462', '524', '368', '542', '942', '264', '895', '856', '486', '342', '635', '548', '694', '925', '392', '369', '896', '394', '634', '965', '523', '468', '938', '365', '853', '956', '926', '283', '952', '463', '894', '498', '384', '946', '469', '269', '826', '425', '246', '396', '893', '824', '348', '682', '936', '948', '596', '385', '248', '429', '825', '836', '569', '362', '326', '295', '625', '962', '923', '528', '846', '286', '426', '435', '932', '985', '546', '253', '598', '495', '928', '432', '254', '234', '639', '438', '439', '239', '538', '543', '984', '354', '492', '854', '285', '289', '593', '459', '832', '632', '298', '243', '586', '839', '564', '835', '645', '263', '693', '649', '583', '945', '958', '428', '256', '963', '689', '249', '436', '684', '293', '865', '562', '592', '568', '258', '964', '489', '325', '642', '296', '628', '458', '456', '483', '236', '245', '582', '534', '968', '386', '589', '638', '536', '892', '359', '834', '823', '986', '265', '869', '238', '346', '563', '654'}

In [71]:
# armazenar a lista em uma variável
lista = list(all_combinations)

In [72]:
#verifiando o tipo 
type(lista[0])

str

* No caso temos uma `string` mas para fazer as somas precisavos de `ints` então vou transformar:

In [73]:
# trocando o formado
lista = [int(i) for i in lista]

# verificando novamente o tipo
print(type(lista[0]))

<class 'int'>

## 2) Quais pares podemos formar que resultem em a + b = 985

In [74]:
# pacotes
from itertools import combinations 
from itertools import permutations

# funcao para achar as combinações
def acha_par(lst, soma): 
	"""
  lst - uma lista com valores 
  soma - qual o nosso "target" de soma
  """
	res = []
	for var in permutations(lst, 2): # dentro das combinações de 2 numeros percorra
		if var[0] + var[1] == soma: # some os valores da tupla e caso seja igual a 985
			res.append((var[0], var[1])) # pegue os valores e armazene em uma lista
		
	return res 

# printando 
lst = lista
target = 985
print(acha_par(lst, target))

[(496, 489), (643, 342), (529, 456), (526, 459), (692, 293), (423, 562), (549, 436), (493, 492), (453, 532), (356, 629), (389, 596), (623, 362), (659, 326), (532, 453), (629, 356), (462, 523), (342, 643), (392, 593), (523, 462), (396, 589), (596, 389), (362, 623), (326, 659), (546, 439), (639, 346), (439, 546), (492, 493), (593, 392), (459, 526), (689, 296), (436, 549), (293, 692), (562, 423), (489, 496), (296, 689), (456, 529), (589, 396), (346, 639)]

In [75]:
# armazenando os resultados
resposta = acha_par(lst, target)

In [76]:
#verificando o tipo 
type(resposta)

list

In [77]:
#confirmando que é uma tupla 
type(resposta[0])

tuple

## 3) Formando as palavras 

Para essa fase eu vou criar um `dataframe` (planilha do pandas) para facilitar a manipulação dos dados com o pandas.

**Passo a passo**
1. Colocar os valores em um `dataframe` 
2. Confirmar que eles somados dão 985 
3. Criar as palavras
  * separar cada algarismo do número
  * traduzir para letra 
  * juntar as letras para formar os anagramas

In [78]:
#criando um dataframe
resp_df = pd.DataFrame(list(resposta), columns= ["1_num", "2_num"])
#verificar as primeiras entradas
resp_df.head()

   1_num  2_num
0    496    489
1    643    342
2    529    456
3    526    459
4    692    293

In [79]:
# criar uma coluna com a soma para verificar se é 985
resp_df["soma"] = resp_df["1_num"]+ resp_df["2_num"]

#verificar resultado 
resp_df.head()

   1_num  2_num  soma
0    496    489   985
1    643    342   985
2    529    456   985
3    526    459   985
4    692    293   985

* Para não verificar uma por uma vou pedir os valores únicos. Caso seja somente 985, os dados fazem sentido

In [80]:
# teste de unico
resp_df['soma'].unique()

array([985])

* Para facilitar a manipulação de dados vou transformar em texto

In [81]:
# transformando em str
resp_df['1_num']=resp_df['1_num'].apply(str)
resp_df['2_num']=resp_df['2_num'].apply(str)

In [82]:
#verificando novamente o df 
resp_df.head()

  1_num 2_num  soma
0   496   489   985
1   643   342   985
2   529   456   985
3   526   459   985
4   692   293   985

Quero criar uma tabela que tenha todas a letras individualmente em uma coluna, para isso vou manipular a coluna `1_num` e `2_num`

In [83]:
# retirando os numeros da primeio anagrama
resp_df['1_letra'] = resp_df['1_num'].astype(str).str[0]
resp_df['2_letra'] = resp_df['1_num'].astype(str).str[1]
resp_df['3_letra'] = resp_df['1_num'].astype(str).str[2]

# retirando os numeros do segundo anagrama
resp_df['4_letra'] = resp_df['2_num'].astype(str).str[0]
resp_df['5_letra'] = resp_df['2_num'].astype(str).str[1]
resp_df['6_letra'] = resp_df['2_num'].astype(str).str[2]

In [84]:
# novo dataframe
resp_df.head()

  1_num 2_num  soma 1_letra 2_letra 3_letra 4_letra 5_letra 6_letra
0   496   489   985       4       9       6       4       8       9
1   643   342   985       6       4       3       3       4       2
2   529   456   985       5       2       9       4       5       6
3   526   459   985       5       2       6       4       5       9
4   692   293   985       6       9       2       2       9       3

* Agora só precisamos fazer as equivalencias com base no dicionário fornecido

In [85]:
# criando o dicionário
di = {"4": "c", "6": "e", "5":"l","8":"o","9":"s","2":"u","3":"z"}

In [86]:
# substituindo numero por letra
resp_df['1_letra'] = resp_df['1_letra'].map(di) 
resp_df['2_letra'] = resp_df['2_letra'].map(di) 
resp_df['3_letra'] = resp_df['3_letra'].map(di) 
resp_df['4_letra'] = resp_df['4_letra'].map(di) 
resp_df['5_letra'] = resp_df['5_letra'].map(di) 
resp_df['6_letra'] = resp_df['6_letra'].map(di)

In [87]:
resp_df.head()

  1_num 2_num  soma 1_letra 2_letra 3_letra 4_letra 5_letra 6_letra
0   496   489   985       c       s       e       c       o       s
1   643   342   985       e       c       z       z       c       u
2   529   456   985       l       u       s       c       l       e
3   526   459   985       l       u       e       c       l       s
4   692   293   985       e       s       u       u       s       z

* Vamos criar uma coluna chamada `palavra1` (concatenar letras 1 a 3) e `palavra2` (concatenar letras 1 a 3)

In [88]:
#concatenando letras para formar anagramas
resp_df["palavra1"] = resp_df["1_letra"] + resp_df["2_letra"] + resp_df["3_letra"]
resp_df["palavra2"] = resp_df["4_letra"] + resp_df["5_letra"] + resp_df["6_letra"]

In [89]:
resp_df.head()

  1_num 2_num  soma 1_letra 2_letra  ... 4_letra 5_letra 6_letra palavra1 palavra2
0   496   489   985       c       s  ...       c       o       s      cse      cos
1   643   342   985       e       c  ...       z       c       u      ecz      zcu
2   529   456   985       l       u  ...       c       l       e      lus      cle
3   526   459   985       l       u  ...       c       l       s      lue      cls
4   692   293   985       e       s  ...       u       s       z      esu      usz

[5 rows x 11 columns]

* Resolvemos o problema

**Para garantir a integridade dos dados vamos:**
1. fazer uma cópia da base
2. criar um código único e dropar duplicadas para não termos valores repetidos
3. importar os dados para um excel

In [90]:
#copia do df
df = resp_df.copy()

In [91]:
df.head()

  1_num 2_num  soma 1_letra 2_letra  ... 4_letra 5_letra 6_letra palavra1 palavra2
0   496   489   985       c       s  ...       c       o       s      cse      cos
1   643   342   985       e       c  ...       z       c       u      ecz      zcu
2   529   456   985       l       u  ...       c       l       e      lus      cle
3   526   459   985       l       u  ...       c       l       s      lue      cls
4   692   293   985       e       s  ...       u       s       z      esu      usz

[5 rows x 11 columns]

In [92]:
# criando código único
df["SKU"] = df["1_num"] + df["2_num"]

In [93]:
#contando valores 
df["SKU"].value_counts().sum()

38

In [94]:
# dropando duplicados caso existam
df.drop_duplicates(subset=['SKU'], keep=False);

In [95]:
# tranformar em excel
df.to_excel("respostas_victor_viana.xlsx")